# -*- coding: utf-8 -*-
"""
Created on 2020/9/12
@Author: Tomspiano
@Email: wengenhui.gracie@foxmail.com
@Project: plagiarism-checker
@Product: PyCharm
@Description: plagiarism detection
"""
import os
import sys
from dcheck import process as pc, compare as cmp

stoplist = {
    '两者', '以', '那', '凡是', '又及', '其它', '各个', '拿', '以至于', '比如', '起见', '乃', '但是', '要', '了', '要不然', '再说', '岂但', '也好', '即如',
    '如何', '换言之', '本人', '嘿嘿', '等到', '。', '比及', '纵令', '果然', '至于', '冒', '除', '无论', '的确', '别管', '哪天', '依据', '甚或', '如其',
    '以及', '赖以', '打从', '第', '出来', '不独', '叫', '自个儿', '我们', '因此', '如果', '不是', '再者说', '即', '介于', '而已', '哇', '毋宁', '正巧', '将',
    '正是', '是以', '前此', '$', '不至于', '反之', '甚么', '之所以', '！', '一何', '咱们', '今', '不料', '上', '呵', '与其', '傥然', '呸', '为了', '因而',
    '给', '它们', '如此', '等等', '最', '巴', '然则', '有', '其他', '虽', '别是', '加以', '又', '总而言之', '唯有', '呜', '譬喻', '假如', '乎', '嗡',
    '纵然', '哩', '除开', '兮', '怎样', '光是', '别', '”', '以上', '嘎登', '凭', '有些', '才能', '出于', '莫若', '据此', '于是乎', '啊', '犹自', '“',
    '具体地说', '彼此', '欤', '凭借', '二来', '尽管', '竟而', '倘然', '得', '临', '腾', '由', '内', '非独', '这边', '这就是说', '虽说', '其中', '某某',
    '不若', '如下', '不外乎', '：', '哼唷', '这时', '替代', '庶乎', '所有', '至今', '能', '嘻', '之', '嘿', '果真', '吗', '些', '不怕', '啪达', '恰恰相反',
    '加之', '并', '自己', '乃至', '同时', '非徒', '各', '贼死', '尔后', '这样', '一样', '那边', '怎么样', '比方', '结果', '任凭', '惟其', '再有', '总的说来',
    '分别', '其一', '由此', '向使', '9', '否则', '纵使', '都', '一则', '宁肯', '据', '罢了', '某个', '吧哒', '什么', '不单', '以为', '况且', '换句话说',
    '这么点儿', '焉', '不比', '另外', '无', '只要', '孰知', '咳', '除外', '《', '8', '哈哈', '不然', '人家', '咚', '当', '还要', '总的来看', '俺们', '当然',
    '说来', '本着', '地', '不过', '已', '这会儿', '啥', '不尽然', '3', '如上所述', '不如', '看', '替', '照', '不成', '她', '故而', '为止', '宁可', '那么些',
    '多么', '乃至于', '似的', '自打', '哎呀', '余外', '以至', '借', '始而', '那儿', '正如', '这么些', '及', '也', '莫不然', '》', '一来', '莫如', '那会儿',
    '不但', '按照', '去', '哈', '再则', '使', '对于', '呼哧', '而外', '通过', '顺', '咦', '根据', '比', '尽', '何况', '如', '或', '呕', '本身', '紧接着',
    '自家', '自从', '谁人', '起', '阿', '哪', '作为', '庶几', '尔尔', '冲', '既是', '沿', '他人', '诚然', '者', '这儿', '不管', '故此', '不论', '继后',
    '嘎', '嘛', '仍旧', '即若', '倘若', '接着', '不拘', '则', '较之', '凡', '处在', '2', '像', '一般', '无宁', '依', '再', '正值', '别的', '孰料',
    '其余', '连同', '来说', '望', '诸如', '不', '被', '那些', '依照', '嗯', '何以', '开外', '我', '旁人', '那里', '怎', '截至', '怎么', '如上', '可见',
    '归', '按', '设或', '另', '如是', '谁知', '哎哟', '哎', '是', '呀', '对方', '向着', '那样', '还', '一切', '本地', '个别', '犹且', '于是', '就算',
    '嘘', '继而', '以故', '可是', '与此同时', '该', '由此可见', '甚至', '哪些', '来', '任何', '另一方面', '?', '这次', '不惟', '多少', '随时', '小', '可以',
    '任', '即令', '随后', '各种', '尽管如此', '再其次', '鄙人', '大家', '一', '怎么办', '吓', '么', '为什么', '若夫', '而', '不特', '上下', '然而', '有时',
    '倘或', '宁愿', '尚且', '然后', '除了', '跟', '让', '其次', '若是', '许多', '为何', '1', '某', '何处', '所在', '自身', '若果', '对待', '仍', '嗳',
    '诚如', '一方面', '4', '多', '它', '总之', '即或', '个', '其二', '边', '设若', '哗', '只消', '就要', '自', '连', '难道说', '呢', '人们', '只有',
    '朝', '矣哉', '这般', '此外', '或是', '以便', '就是了', '咋', '此', '般的', '宁', '要是', '这里', '0', '或者', '当地', '人', '一转眼', '喏', '此间',
    '于', '但', '诸位', '乘', '为着', '打', '较', '对比', '只', '6', '前后', '类如', '譬如', '直到', '大', '所以', '哉', '从此', '且不说', '只是', '下',
    '哪怕', '随着', '别人', '若', '那个', '_', '那么', '自各儿', '当着', '简言之', '就是说', '相对而言', '到', '，', '在', '您', '嗬', '这么', '喔唷',
    '先不先', '非但', '他们', '用来', '针对', '离', '以免', '在于', '虽则', '什么样', '之一', '与其说', '由于', '只当', '、', '沿着', '哪边', '还有', '哪年',
    '的', '关于', '的话', '至若', '才', '同', '而言', '几', '省得', '云云', '啷当', '非特', '再者', '遵照', '她们', '不仅', '几时', '这些', '却', '7',
    '此处', '只怕', '例如', '哟', '既往', '距', '叮咚', '怎奈', '固然', '来自', '既然', '着呢', '哪儿', '经', '哪里', '眨眼', '诸', '每', '为此', '？',
    '倘使', '那么样', '并且', '某些', '随', '那时', '亦', '照着', '得了', '即使', '或则', '假使', '全部', '巴巴', '不得', '假若', '就是', '由是', '这么样',
    '前者', '开始', '只限', '待', '何', '之类', '但凡', '彼', '时候', '经过', '俺', '儿', '反而', '5', '反过来说', '要么', '曾', '与', '矣', '因为',
    '趁', '归齐', '故', '咧', '有关', '用', '甚至于', '以来', '他', '没奈何', '趁着', '便于', '能否', '你', '不问', '致', '也罢', '综上所述', '自后', '着',
    '呗', '啐', '已矣', '抑或', '赶', '朝着', '彼时', '除此之外', '顺着', '有的', '而是', '要不', '以致', '不只', '使得', '有及', '如同', '全体', '及至',
    '各位', '及其', '吧', '此地', '不光', '因', '因着', '很', '设使', '甚而', '继之', '矣乎', '受到', '进而', '后', '则甚', '既', '云尔', '哪样', '所幸',
    '逐步', '从而', '呃', '呵呵', '咱', '喂', '因了', '是的', '好', '虽然', '即便', '倘', '那般', '或曰', '向', '和', '具体说来', '漫说', '哼', '论',
    '管', '所', '而况', '可', '己', '唉', '极了', '除非', '慢说', '总的来说', '万一', '若非', '另悉', '遵循', '本', '就', '哦', '喽', '且', '反过来',
    '哪个', '别说', '从', '越是', '还是', '鉴于', '且说', '啦', '各自', '不妨', '每当', '不尽', '谁料', '如若', '为', '后者', '其', '此时', '此次', '；',
    '何时', '往', '乌乎', '并非', '来着', '靠', '对', '别处', '以期', '一些', '谁', '等', '首先', '兼之', '呜呼', '过', '吱', '基于', '与否', '尔',
    '这个', '至', '一旦', '嗡嗡', '们', '在下', '把', '甚且', '这', '纵', '要不是', '这一来', '而且', '你们', '而后'
}


def duplicate_check(paths):
    """ Get similarity of the two documents.

    :param paths: [original document, sample document]
    :return: similarity of the two documents
    """

    assert os.path.isfile(paths[0]), 'Please check the path of the original document.'
    assert os.path.isfile(paths[1]), 'Please check the path of the sample document.'

    # process the documents
    texts = pc.segment(paths, stoplist)

    # get similarity
    return cmp.get_sim(texts)


if __name__ == '__main__':
    # read command
    assert len(
            sys.argv) == 4, 'Please use the format: python main.py [original document] [sample document] ' \
                            '[evaluation result]'
    ori = sys.argv[1]
    smp = sys.argv[2]
    rst = sys.argv[3]

    sim = duplicate_check([ori, smp])

    # save the result
    try:
        with open(rst, 'w', encoding='utf-8') as f:
            f.write('{:.2f}'.format(sim))
    except FileNotFoundError:
        print('Path does NOT exist! The result is saved in the current path named output.txt!')
        with open('output.txt', 'w', encoding='utf-8') as f:
            f.write('{:.2f}'.format(sim))
